In [1]:
import pandas as pd

In [2]:
csv_data = pd.read_csv("../Resources/order_data.csv")
csv_data.head()

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565         NaN   4/24/2019

- dollar signs
- dates aren't same format
- order total has NaNs
- dupe data


"outside of class" - these might be things to deal with:
- customer num is combo num/letters
- inconsistent size of order_no, cust_no
- data resolution/validation
- quotes in strings

In [3]:
csv_data.dtypes

order_no        int64
customer_no    object
order_total    object
order_date     object
dtype: object

In [4]:
csv_data.count()

order_no       8
customer_no    7
order_total    7
order_date     8
dtype: int64

In [6]:
csv_data["customer_no"].value_counts()

CM458565    2
AK45765     2
CJ458565    1
TV4663      1
2124        1
Name: customer_no, dtype: int64

In [8]:
csv_data.isnull().sum()

order_no       0
customer_no    1
order_total    1
order_date     0
dtype: int64

In [10]:
csv_data["customer_no"] = csv_data["customer_no"].fillna("Unknown")
csv_data

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565         NaN   4/24/2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

In [11]:
csv_data.dropna(inplace=True)
csv_data

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

In [13]:
csv_data.duplicated()

0    False
1    False
2    False
3     True
5    False
6    False
7    False
dtype: bool

In [16]:
csv_data.drop_duplicates(inplace=True)

In [17]:
csv_data

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

In [19]:
csv_data["order_total"] = csv_data["order_total"].str.replace("$","")

In [21]:
csv_data

     order_no customer_no order_total  order_date
0   452517125    CM458565      141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765     1103.36  04-25-2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown      141.25  01-10-2019

In [22]:
csv_data.dtypes

order_no        int64
customer_no    object
order_total    object
order_date     object
dtype: object

In [23]:
csv_data["order_total"] = csv_data["order_total"].astype("float")

In [24]:
csv_data

     order_no customer_no  order_total  order_date
0   452517125    CM458565       141.25  01-10-2019
1    45251825    CJ458565        14.00  04/25/2019
2  4465241327     AK45765      1103.36  04-25-2019
5    45235825      TV4663        65.42  04-29-2019
6     2356363        2124    258936.12  04-29-2019
7   452519232     Unknown       141.25  01-10-2019

In [25]:
csv_data.dtypes

order_no         int64
customer_no     object
order_total    float64
order_date      object
dtype: object